/* RexUnknownFileReadError */

/* This particular localized description won't be presented to the user, but
 * it's always a good idea to provide a decent description that's a full
 * sentence, just in case the error gets reused in a new way.
 */
"description1" = "IORegistryExplorer document data could not be read because it is corrupted.";

/* This localized failure reason will be presented to the user if we're trying
 * to open a document. When -[RexDrawDocument readFromData:ofType:error:]
 * returns an error NSDocumentController will take the failure reason and tack
 * it onto the end of a "The document "so-and-so" could not be opened." message
 * and use the whole thing as an error description. Full sentence!
 */
"failureReason1" = "It appears to be corrupted.";


/*****
 * These strings describe an error for a file format that's just too old.
 */
"description2" = "IORegistryExplorer document data could not be read because it is an old format.";

"failureReason2" = "It is saved in an old format that cannot be used with this version of IORegistryExplorer.";
